<html><head><title>Untitled document</title><style type="text/css">ol{margin:0;padding:0}.c2{max-width:468pt;background-color:#ffffff;padding:72pt 72pt 72pt 72pt}.c1{height:11pt}.c0{direction:ltr}.title{padding-top:24pt;line-height:1.15;text-align:left;color:#000000;font-size:36pt;font-family:"Arial";font-weight:bold;padding-bottom:6pt}.subtitle{padding-top:18pt;line-height:1.15;text-align:left;color:#666666;font-style:italic;font-size:24pt;font-family:"Georgia";padding-bottom:4pt}li{color:#000000;font-size:11pt;font-family:"Arial"}p{color:#000000;font-size:11pt;margin:0;font-family:"Arial"}h1{padding-top:24pt;line-height:1.15;text-align:left;color:#000000;font-size:18pt;font-family:"Arial";font-weight:bold;padding-bottom:6pt}h2{padding-top:18pt;line-height:1.15;text-align:left;color:#000000;font-size:14pt;font-family:"Arial";font-weight:bold;padding-bottom:4pt}h3{padding-top:14pt;line-height:1.15;text-align:left;color:#666666;font-size:12pt;font-family:"Arial";font-weight:bold;padding-bottom:4pt}h4{padding-top:12pt;line-height:1.15;text-align:left;color:#666666;font-style:italic;font-size:11pt;font-family:"Arial";padding-bottom:2pt}h5{padding-top:11pt;line-height:1.15;text-align:left;color:#666666;font-size:10pt;font-family:"Arial";font-weight:bold;padding-bottom:2pt}h6{padding-top:10pt;line-height:1.15;text-align:left;color:#666666;font-style:italic;font-size:10pt;font-family:"Arial";padding-bottom:2pt}</style></head><body class="c2"><p class="c0"><span>Tytu&#322;: Kalendarz z mo&#380;liwo&#347;ci&#261; dodawania zada&#324; do wykonania oraz przypomnie&#324;</span></p><p class="c0"><span>Technologia: Qt + C++</span></p><p class="c1 c0"><span></span></p><p class="c0"><span>1. Jako u&#380;ytkownik chcia&#322;bym mie&#263; menu g&#322;&oacute;wne na szczycie interfejsu.</span></p><p class="c1 c0"><span></span></p><p class="c0"><span>2. Jako u&#380;ytkownik chcia&#322;bym w menu wybiera&#263; miesi&#261;ce z dropdown menu.</span></p><p class="c1 c0"><span></span></p><p class="c0"><span>3. Jako u&#380;ytkownik chcia&#322;bym w menu wybiera&#263; rok z dropdown menu.</span></p><p class="c0 c1"><span></span></p><p class="c0"><span>4. Jako u&#380;ytkownik chcia&#322;bym, aby reszt&#281; interfejsu wype&#322;nia&#322;y ikonki z poszczeg&oacute;lnymi dniami miesi&#261;ca.</span></p><p class="c0"><span>5. Jako u&#380;ytkownik chcia&#322;bym, aby dni by&#322;y pouk&#322;adane w kolumnach od poniedzia&#322;ku do niedzieli oraz w rz&#281;dach z numerami tygodnia.</span></p><p class="c0"><span>6. Jako u&#380;ytkownik chcia&#322;bym po klikni&#281;ciu na poszczeg&oacute;ln&#261; ikon&#281; wej&#347;&#263; w menu szczeg&oacute;&#322;owe konkretnego dnia.</span></p><p class="c0"><span>7. Jako u&#380;ytkownik chcia&#322;bym w menu szczeg&oacute;&#322;owym dnia otrzyma&#263; list&#281; zaplanowanych na ten dzie&#324; zada&#324;.</span></p><p class="c0"><span>8. Jako u&#380;ytkownik chcia&#322;bym, aby ka&#380;de z zada&#324; mia&#322;o na boku checkbox do zaznaczania wykonanych zada&#324;.</span></p><p class="c0"><span>9. Chcia&#322;bym, aby w menu dnia by&#322;a r&oacute;wnie&#380; mo&#380;liwo&#347;&#263; dodania nowego zadania jako ikona u szczytu interfejsu.</span></p><p class="c0"><span>10. Chcia&#322;bym, aby metoda dodawania nowego zadania mia&#322;a 2 pola tekstowe do wype&#322;nienia:</span></p><p class="c0"><span>tytu&#322; oraz opis.</span></p><p class="c0"><span>11. Chcia&#322;bym, aby godzin&#281; rozpocz&#281;cia i zako&#324;czenia zadania ustawia&#322;o si&#281; przy pomocy 2 dropdown menu po jednym dla rozpocz&#281;cia i zako&#324;czenia zadania.</span></p><p class="c0"><span>12. Chcia&#322;bym, aby przy tworzeniu nowego zadania istnia&#322;a r&oacute;wnie&#380; mo&#380;liwo&#347;&#263; ustawienia nieobligatoryjnego przypomnienia o nadchodz&#261;cym zadaniu.</span></p><p class="c0"><span>13. Chcia&#322;bym, aby mo&#380;liwe by&#322;o wybranie spo&#347;r&oacute;d kilku opcji ile czasu przed rozpocz&#281;ciem zadania ma si&#281; pojawi&#263; przypomnienie.</span></p><p class="c0"><span>14. Chcia&#322;bym, &#380;eby w menu konkretnego dnia istnia&#322;a r&oacute;wnie&#380; mo&#380;liwo&#347;&#263; klikania na poszczeg&oacute;lne zadania w celu wy&#347;wietlenia szczeg&oacute;&#322;&oacute;w.</span></p><p class="c0"><span>15. Chcia&#322;bym, &#380;eby w szczeg&oacute;&#322;ach zadania istnia&#322;a metoda usu&#324; zadanie.</span></p><p class="c0"><span>16. Chcia&#322;bym, zeby w szczeg&oacute;&#322;ach zadania istnia&#322;a r&oacute;wnie&#380; metoda edytuj zadanie.</span></p><p class="c0"><span>17. Chcia&#322;bym, zeby po klikni&#281;ciu na edytuj zadanie pojawia&#322;o si&#281; menu takie jak przy tworzeniu nowego zadania.</span></p><p class="c0"><span>18. Chcia&#322;bym, &#380;eby przypomnienia o zadaniach mia&#322;y form&#281; tekstow&#261;.</span></p><p class="c0"><span>19. Chcia&#322;bym, &#380;eby przypomnienia dawa&#322;y o sobie zna&#263; kr&oacute;tkim d&#378;wi&#281;kiem.</span></p></body></html>